run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/wycinekRury/bezQ/wycinekRuryBlockMeshBezQ/0.org/Un
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Un;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (6.22 0 0);

boundaryField
{
    WALL
    {
        type            superFluidWallUn;
		value			uniform (0 0 0);
    }
    INLET
    {
        type            fixedValue;
        value           $internalField;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    SYMMETRY-SIDE-1
    {
        type            wedge;
    }
    SYMMETRY-SIDE-2
    {
        type            wedge;
    }
}


// ************************************************************************* //
