run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/wycinekRury/bezQ/wycinekRuryBlockMeshBezQ/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue nut 0
);

regions
(
    boxToCell
    {
	    box (-10 -10 -10) (0.01 10 10);
        fieldValues
        (
            volScalarFieldValue nut 0.0001
        );
    }
);


// ************************************************************************* //
